Revit 2026 API

# WallGetWrappingLocationAsCurveParameter Method

---

Gets the non-normalized (actual) curve parameter of the location.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetWrappingLocationAsCurveParameter(
	int locationIndex
)
```
```vb
Public Function GetWrappingLocationAsCurveParameter (
	locationIndex As Integer
) As Double
```
```cpp
public:
double GetWrappingLocationAsCurveParameter(
	int locationIndex
)
```
```fsharp
member GetWrappingLocationAsCurveParameter :
        locationIndex : int -> float
```

#### Parameters

locationIndex Int32
     0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.

#### Return Value

Double The non-normalized (actual) curve parameter value on the curve.

| Exception | Condition |
| --- | --- |
| ArgumentException | This location is invalid for wrapping. |

If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace